OpenFOAM-5.x/tutorials/mesh/foamyHexMesh/mixerVessel/Allrun-simulation
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp system/controlDict.flow system/controlDict

# Set application name
application=$(getApplication)

rm -rf 0

runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

# Get rid of zero faced patches
runApplication createPatch -overwrite

# Copy fields after meshing to avoind the generation of unnecessary patch fields
cp -r 0.orig 0

# Initialize alpha
runApplication setFields

# Decompose
runApplication -s main \
    decomposePar -force

# Run
runParallel $application

# Reconstruct
runApplication reconstructPar -noFunctionObjects


#------------------------------------------------------------------------------
